#include"../../inc/phone.h"
// \33[ 开头表示这是一个控制字符序列。
// 0;33 表示设置文本颜色为绿色。
// m 表示设置生效

// 常用的 ANSI 颜色控制码：

// \033[0m ：默认设置(默认文字颜色和背景颜色)
// \033[1m ：设置高亮度(加粗)
// \033[4m ：设置下划线
// \033[5m ： 设置闪烁
// \033[7m ： 设置反显
// **\033[0;30m**：黑色
// **\033[1;30m**：深灰色
// **\033[0;31m**：红色
// **\033[1;31m**：浅红色
// **\033[0;32m**：绿色
// **\033[1;32m**：浅绿色
// **\033[0;33m**：棕色
// **\033[1;33m**：黄色
// **\033[0;34m**：蓝色
// **\033[1;34m**：浅蓝色
// **\033[0;35m**：粉红
// **\033[1;35m**：浅粉色
// **\033[0;36m**：青色
// **\033[1;36m**：浅青色
// **\033[0;37m**：浅灰色
// **\033[1;37m**：白色
// 除了设置前景颜色，Bash 还允许设置背景颜色：

// \033[0;40m：蓝色
// \033[1;44m：黑色
// \033[0;41m：红色
// \033[1;45m：粉红
// \033[0;42m：绿色
// \033[1;46m：青色
// \033[0;43m：棕色
// \033[1;47m：浅灰色
extern char password[32];

int login_menu(){
	int i = 3;
	char name[32] = {0};
	char pass[32] = {0};
	
	printf("\033[0;96m+=================================================================+\033[0m\n");
	printf("\033[0;96m| 								  |\033[0m\n");
	printf("\033[0;96m| \t\t欢迎来到Zeins的通讯录 			          |\033[0m\n");
	printf("\033[0;96m| 								  |\033[0m\n");
	printf("\033[0;96m| 			温馨提示：初始密码(zeins)	          |\033[0m\n");
	printf("\033[0;96m| 				                                  |\033[0m\n");	
	printf("\033[0;96m+=================================================================+\033[0m\n");

    while(i > 0){
		printf("\033[0;96mplease input your password:\033[0m\n");
		scanf("%s",pass);
		if(strcmp(password,pass) == 0)
		{
		    return 0;
		}
		else
		{
		    i--;
		    printf("password error!,The remaining number of times is:%d\n",i);
		}
    }
    if(i == 0)
    {
		printf("over!");
		return -1;
    }

}



int phone_menu(){
    int opt;

    while(1){
        system("clear");
        printf("\033[1;31m+*******************电话号码管理软件*******************+\033[7m\n");
        printf("\033[1;32m|1. 添加                                               |\033[7m\n");
        printf("\033[1;32m|2. 删除                                               |\033[7m\n");
        printf("\033[1;32m|3. 查找                                               |\033[7m\n");
        printf("\033[1;32m|4. 显示所有记录                                       |\033[7m\n");
        printf("\033[1;32m|0. 退出                                               |\033[7m\n");
        printf("\033[1;31m+******************************************************+\033[7m\n");

        printf("\033[0;33mInput your choice#\033[5m\n");
        scanf("%d",&opt);//设备行缓冲写入stdin
        if(opt < 0 || opt > 4){
            fflush(stdin);                  //清空输入缓冲区，

            printf("\033[1;31m无效选项,请重新输入: \033[0m");
            getchar();//停顿，不然马上清屏看不到信息，两个是不是因为上面scanf还留了一个\n？
            getchar();
            continue;
        }
        return opt;
    }
}
